org/20220207142439-sisyphus_myth_and_home_ownership.org
:PROPERTIES:
:ID:       0f2659d6-ada5-4109-9318-c04f9246eebf
:END:
#+TITLE: Sisyphus' myth and home ownership
#+CREATED: [2022-02-07 Mon 14:24]
#+LAST_MODIFIED: [2022-02-07 Mon 14:29]

Sisyphus's myth starts to make sens when you own a home. Wanting a perfectly functioning home is a losing proposition. [[id:42438bf3-d611-48b5-aba1-046f05a50b27][Life is a constant struggle against the 2nd law of thermodynamics]] and owning a home brings proof. Every day you repair something, enjoy the state of your home for a few days, weeks, until something breaks again and you have to deal with it.

You have to find happiness in this uninterrupted flow.

#+begin_quote
Il faut imaginer Sisyphe heureux.
-- Albert Camus, Le mythe de Sisyphe
#+end_quote
