20220207142439-sisyphus_myth_and_home_ownership.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-24 Wed 22:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sisyphus' myth and home ownership</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Sisyphus' myth and home ownership</h1>
<p>
Sisyphus's myth starts to make sens when you own a home. Wanting a perfectly functioning home is a losing proposition. <a href="20220207142707-life_is_a_constant_struggle_against_the_2nd_law_of_thermodynamics.html#ID-42438bf3-d611-48b5-aba1-046f05a50b27">Life is a constant struggle against the 2nd law of thermodynamics</a> and owning a home brings proof. Every day you repair something, enjoy the state of your home for a few days, weeks, until something breaks again and you have to deal with it.
</p>

<p>
You have to find happiness in this uninterrupted flow.
</p>

<blockquote>
<p>
Il faut imaginer Sisyphe heureux.
&#x2013; Albert Camus, Le mythe de Sisyphe
</p>
</blockquote>

<div id="outline-container-org2e11624" class="outline-2">
<h2 id="org2e11624">Links to this note</h2>
</div>
</div>
</body>
</html>
